package com.galya.business.productioncapacity.persistence;

import static com.galya.business.productioncapacity.persistence.ProductionCapacityDatabaseManager.VARCHAR_MAX_LENGTH;

import java.sql.Connection;
import java.sql.PreparedStatement;
import java.sql.ResultSet;
import java.sql.SQLException;
import java.sql.Statement;
import java.util.ArrayList;
import java.util.List;

public class AdministrativeRuralAreasTableHelper implements TableHelper {

    private static final String DATABASE_NAME = ProductionCapacityDatabaseManager.DATABASE_NAME;

    private static final String ADM_RURAL_AREAS_TABLE = "BG_Administrative_Rural_Areas";

    private static final String ADM_RURAL_AREAS_TABLE_ID = "_id";
    private static final String ADM_RURAL_AREAS_TABLE_MUNICIPALITY_NAME = "municipality_name";
    private static final String ADM_RURAL_AREAS_TABLE_DISTRICT_NAME = "district_name";
    private static final String ADM_RURAL_AREAS_TABLE_REGION_NAME = "region_name";

    private static final String ADM_RURAL_AREAS_TABLE_CREATION_QUERY = "CREATE TABLE IF NOT EXISTS "
            + ADM_RURAL_AREAS_TABLE + " (" + ADM_RURAL_AREAS_TABLE_ID + " integer primary key autoincrement, "
            + ADM_RURAL_AREAS_TABLE_MUNICIPALITY_NAME + " varchar(" + VARCHAR_MAX_LENGTH + ") not null, "
            + ADM_RURAL_AREAS_TABLE_DISTRICT_NAME + " varchar(" + VARCHAR_MAX_LENGTH + ") not null, "
            + ADM_RURAL_AREAS_TABLE_REGION_NAME + " varchar(" + VARCHAR_MAX_LENGTH + ") not null" + ");";

    private static AdministrativeRuralAreasTableHelper instance;

    public static AdministrativeRuralAreasTableHelper getInstance() {
        if (instance == null) {
            return new AdministrativeRuralAreasTableHelper();
        }
        return instance;
    }

    private AdministrativeRuralAreasTableHelper() {
    }

    @Override
    public String getDatabaseName() {
        return DATABASE_NAME;
    }

    @Override
    public String getTableName() {
        return ADM_RURAL_AREAS_TABLE;
    }

    @Override
    public void createTable(Connection connection) throws SQLException {
        Statement stmt = connection.createStatement();
        stmt.executeUpdate(ADM_RURAL_AREAS_TABLE_CREATION_QUERY);
        stmt.close();
    }

    @Override
    public void populateDefaultValues(Connection connection) throws SQLException {
        PreparedStatement stmt = connection
                .prepareStatement("INSERT INTO "
                        + ADM_RURAL_AREAS_TABLE
                        + " ("
                        + ADM_RURAL_AREAS_TABLE_MUNICIPALITY_NAME
                        + ", "
                        + ADM_RURAL_AREAS_TABLE_DISTRICT_NAME
                        + ", "
                        + ADM_RURAL_AREAS_TABLE_REGION_NAME
                        + ") VALUES ('Банско', 'Благоевград', 'Югозападен'),('Белица', 'Благоевград', 'Югозападен'),('Гоце Делчев', 'Благоевград', 'Югозападен'),('Гърмен', 'Благоевград', 'Югозападен'),('Кресна', 'Благоевград', 'Югозападен'),('Петрич', 'Благоевград', 'Югозападен'),('Разлог', 'Благоевград', 'Югозападен'),('Сандански', 'Благоевград', 'Югозападен'),('Сатовча', 'Благоевград', 'Югозападен'),('Симитли', 'Благоевград', 'Югозападен'),('Струмяни', 'Благоевград', 'Югозападен'),('Хаджидимово', 'Благоевград', 'Югозападен'),('Якоруда', 'Благоевград', 'Югозападен'),('Айтос', 'Бургас', 'Югоизточен'),('Камено', 'Бургас', 'Югоизточен'),('Карнобат', 'Бургас', 'Югоизточен'),('Малко Търново', 'Бургас', 'Югоизточен'),('Несебър', 'Бургас', 'Югоизточен'),('Поморие', 'Бургас', 'Югоизточен'),('Приморско', 'Бургас', 'Югоизточен'),('Руен', 'Бургас', 'Югоизточен'),('Созопол', 'Бургас', 'Югоизточен'),('Средец', 'Бургас', 'Югоизточен'),('Сунгурларе', 'Бургас', 'Югоизточен'),('Царево', 'Бургас', 'Югоизточен'),('Аврен', 'Варна', 'Североизточен'),('Аксаково', 'Варна', 'Североизточен'),('Белослав', 'Варна', 'Североизточен'),('Бяла', 'Варна', 'Североизточен'),('Ветрино', 'Варна', 'Североизточен'),('Вълчи дол', 'Варна', 'Североизточен'),('Девня', 'Варна', 'Североизточен'),('Долни чифлик', 'Варна', 'Североизточен'),('Дългопол', 'Варна', 'Североизточен'),('Провадия', 'Варна', 'Североизточен'),('Суворово', 'Варна', 'Североизточен'),('Елена', 'Велико Търново', 'Северен централен'),('Златарица', 'Велико Търново', 'Северен централен'),('Лясковец', 'Велико Търново', 'Северен централен'),('Павликени', 'Велико Търново', 'Северен централен'),('Полски Тръмбеш', 'Велико Търново', 'Северен централен'),('Стражица', 'Велико Търново', 'Северен централен'),('Сухиндол', 'Велико Търново', 'Северен централен'),('Белоградчик', 'Видин', 'Северозападен'),('Бойница', 'Видин', 'Северозападен'),('Брегово', 'Видин', 'Северозападен'),('Грамада', 'Видин', 'Северозападен'),('Димово', 'Видин', 'Северозападен'),('Кула', 'Видин', 'Северозападен'),('Макреш', 'Видин', 'Северозападен'),('Ново село', 'Видин', 'Северозападен'),('Ружинци', 'Видин', 'Северозападен'),('Чупрене', 'Видин', 'Северозападен'),('Борован', 'Враца', 'Северозападен'),('Бяла Слатина', 'Враца', 'Северозападен'),('Козлодуй', 'Враца', 'Северозападен'),('Криводол', 'Враца', 'Северозападен'),('Мездра', 'Враца', 'Северозападен'),('Мизия', 'Враца', 'Северозападен'),('Оряхово', 'Враца', 'Северозападен'),('Роман', 'Враца', 'Северозападен'),('Хайредин', 'Враца', 'Северозападен'),('Дряново', 'Габрово', 'Северен централен'),('Севлиево', 'Габрово', 'Северен централен'),('Трявна', 'Габрово', 'Северен централен'),('Балчик', 'Добрич', 'Североизточен'),('Генерал Тошево', 'Добрич', 'Североизточен'),('Добрич – селска', 'Добрич', 'Североизточен'),('Каварна', 'Добрич', 'Североизточен'),('Крушари', 'Добрич', 'Североизточен'),('Тервел', 'Добрич', 'Североизточен'),('Шабла', 'Добрич', 'Североизточен'),('Ардино', 'Кърджали', 'Южен централен'),('Джебел', 'Кърджали', 'Южен централен'),('Кирково', 'Кърджали', 'Южен централен'),('Крумовград', 'Кърджали', 'Южен централен'),('Момчилград', 'Кърджали', 'Южен централен'),('Черноочене', 'Кърджали', 'Южен централен'),('Бобов дол', 'Кюстендил', 'Югозападен'),('Бобошево', 'Кюстендил', 'Югозападен'),('Кочериново', 'Кюстендил', 'Югозападен'),('Невестино', 'Кюстендил', 'Югозападен'),('Рила', 'Кюстендил', 'Югозападен'),('Сапарева баня', 'Кюстендил', 'Югозападен'),('Трекляно', 'Кюстендил', 'Югозападен'),('Априлци', 'Ловеч', 'Северозападен'),('Летница', 'Ловеч', 'Северозападен'),('Луковит', 'Ловеч', 'Северозападен'),('Тетевен', 'Ловеч', 'Северозападен'),('Троян', 'Ловеч', 'Северозападен'),('Угърчин', 'Ловеч', 'Северозападен'),('Ябланица', 'Ловеч', 'Северозападен'),('Берковица', 'Монтана', 'Северозападен'),('Бойчиновци', 'Монтана', 'Северозападен'),('Брусарци', 'Монтана', 'Северозападен'),('Вълчедръм', 'Монтана', 'Северозападен'),('Вършец', 'Монтана', 'Северозападен'),('Георги Дамяново', 'Монтана', 'Северозападен'),('Лом', 'Монтана', 'Северозападен'),('Медковец', 'Монтана', 'Северозападен'),('Чипровци', 'Монтана', 'Северозападен'),('Якимово', 'Монтана', 'Северозападен'),('Батак', 'Пазарджик', 'Южен централен'),('Белово', 'Пазарджик', 'Южен централен'),('Брацигово', 'Пазарджик', 'Южен централен'),('Велинград', 'Пазарджик', 'Южен централен'),('Лесичово', 'Пазарджик', 'Южен централен'),('Панагюрище', 'Пазарджик', 'Южен централен'),('Пещера', 'Пазарджик', 'Южен централен'),('Ракитово', 'Пазарджик', 'Южен централен'),('Септември', 'Пазарджик', 'Южен централен'),('Стрелча', 'Пазарджик', 'Южен централен'),('Сърница', 'Пазарджик', 'Южен централен'),('Брезник', 'Перник', 'Югозападен'),('Земен', 'Перник', 'Югозападен'),('Ковачевци', 'Перник', 'Югозападен'),('Радомир', 'Перник', 'Югозападен'),('Трън', 'Перник', 'Югозападен'),('Белене', 'Плевен', 'Северозападен'),('Гулянци', 'Плевен', 'Северозападен'),('Долна Митрополия', 'Плевен', 'Северозападен'),('Долни Дъбник', 'Плевен', 'Северозападен'),('Искър', 'Плевен', 'Северозападен'),('Кнежа', 'Плевен', 'Северозападен'),('Левски', 'Плевен', 'Северозападен'),('Никопол', 'Плевен', 'Северозападен'),('Пордим', 'Плевен', 'Северозападен'),('Червен бряг', 'Плевен', 'Северозападен'),('Брезово', 'Пловдив', 'Южен централен'),('Калояново', 'Пловдив', 'Южен централен'),('Карлово', 'Пловдив', 'Южен централен'),('Кричим', 'Пловдив', 'Южен централен'),('Куклен', 'Пловдив', 'Южен централен'),('Лъки', 'Пловдив', 'Южен централен'),('\"Марица\"', 'Пловдив', 'Южен централен'),('Перущица', 'Пловдив', 'Южен централен'),('Първомай', 'Пловдив', 'Южен централен'),('Раковски', 'Пловдив', 'Южен централен'),('\"Родопи\"', 'Пловдив', 'Южен централен'),('Садово', 'Пловдив', 'Южен централен'),('Сопот', 'Пловдив', 'Южен централен'),('Стамболийски', 'Пловдив', 'Южен централен'),('Съединение', 'Пловдив', 'Южен централен'),('Хисаря', 'Пловдив', 'Южен централен'),('Завет', 'Разград', 'Северен централен'),('Исперих', 'Разград', 'Северен централен'),('Кубрат', 'Разград', 'Северен централен'),('Лозница', 'Разград', 'Северен централен'),('Самуил', 'Разград', 'Северен централен'),('Цар Калоян', 'Разград', 'Северен централен'),('Борово', 'Русе', 'Северен централен'),('Бяла', 'Русе', 'Северен централен'),('Ветово', 'Русе', 'Северен централен'),('Две могили', 'Русе', 'Северен централен'),('Иваново', 'Русе', 'Северен централен'),('Сливо поле', 'Русе', 'Северен централен'),('Ценово', 'Русе', 'Северен централен'),('Алфатар', 'Силистра', 'Северен централен'),('Главиница', 'Силистра', 'Северен централен'),('Дулово', 'Силистра', 'Северен централен'),('Кайнарджа', 'Силистра', 'Северен централен'),('Ситово', 'Силистра', 'Северен централен'),('Тутракан', 'Силистра', 'Северен централен'),('Котел', 'Сливен', 'Югоизточен'),('Нова Загора', 'Сливен', 'Югоизточен'),('Твърдица', 'Сливен', 'Югоизточен'),('Баните', 'Смолян', 'Южен централен'),('Борино', 'Смолян', 'Южен централен'),('Девин', 'Смолян', 'Южен централен'),('Доспат', 'Смолян', 'Южен централен'),('Златоград', 'Смолян', 'Южен централен'),('Мадан', 'Смолян', 'Южен централен'),('Неделино', 'Смолян', 'Южен централен'),('Рудозем', 'Смолян', 'Южен централен'),('Чепеларе', 'Смолян', 'Южен централен'),('Антон', 'София област', 'Югозападен'),('Божурище', 'София област', 'Югозападен'),('Ботевград', 'София област', 'Югозападен'),('Годеч', 'София област', 'Югозападен'),('Горна Малина', 'София област', 'Югозападен'),('Долна баня', 'София област', 'Югозападен'),('Драгоман', 'София област', 'Югозападен'),('Елин Пелин', 'София област', 'Югозападен'),('Етрополе', 'София област', 'Югозападен'),('Златица', 'София област', 'Югозападен'),('Ихтиман', 'София област', 'Югозападен'),('Копривщица', 'София област', 'Югозападен'),('Костенец', 'София област', 'Югозападен'),('Костинброд', 'София област', 'Югозападен'),('Мирково', 'София област', 'Югозападен'),('Пирдоп', 'София област', 'Югозападен'),('Правец', 'София област', 'Югозападен'),('Самоков', 'София област', 'Югозападен'),('Своге', 'София област', 'Югозападен'),('Сливница', 'София област', 'Югозападен'),('Чавдар', 'София област', 'Югозападен'),('Челопеч', 'София област', 'Югозападен'),('Братя Даскалови', 'Стара Загора', 'Югоизточен'),('Гурково', 'Стара Загора', 'Югоизточен'),('Гълъбово', 'Стара Загора', 'Югоизточен'),('Мъглиж', 'Стара Загора', 'Югоизточен'),('Николаево', 'Стара Загора', 'Югоизточен'),('Опан', 'Стара Загора', 'Югоизточен'),('Павел баня', 'Стара Загора', 'Югоизточен'),('Раднево', 'Стара Загора', 'Югоизточен'),('Чирпан', 'Стара Загора', 'Югоизточен'),('Антоново', 'Търговище', 'Североизточен'),('Омуртаг', 'Търговище', 'Североизточен'),('Опака', 'Търговище', 'Североизточен'),('Попово', 'Търговище', 'Североизточен'),('Ивайловград', 'Хасково', 'Южен централен'),('Любимец', 'Хасково', 'Южен централен'),('Маджарово', 'Хасково', 'Южен централен'),('Минерални бани', 'Хасково', 'Южен централен'),('Свиленград', 'Хасково', 'Южен централен'),('Симеоновград', 'Хасково', 'Южен централен'),('Стамболово', 'Хасково', 'Южен централен'),('Тополовград', 'Хасково', 'Южен централен'),('Харманли', 'Хасково', 'Южен централен'),('Велики Преслав', 'Шумен', 'Североизточен'),('Венец', 'Шумен', 'Североизточен'),('Върбица', 'Шумен', 'Североизточен'),('Каолиново', 'Шумен', 'Североизточен'),('Каспичан', 'Шумен', 'Североизточен'),('Никола Козлево', 'Шумен', 'Североизточен'),('Нови пазар', 'Шумен', 'Североизточен'),('Смядово', 'Шумен', 'Североизточен'),('Хитрино', 'Шумен', 'Североизточен'),('Болярово', 'Ямбол', 'Югоизточен'),('Елхово', 'Ямбол', 'Югоизточен'),('Стралджа', 'Ямбол', 'Югоизточен'),('Тунджа', 'Ямбол', 'Югоизточен')");

        stmt.executeUpdate();
        stmt.close();
    }

    public List<String> getAllRegions() {
        List<String> allRegionsList = new ArrayList<String>();

        try (Connection connection = ProductionCapacityDatabaseManager.getConnection();) {
            PreparedStatement stmt = connection.prepareStatement("SELECT DISTINCT " + ADM_RURAL_AREAS_TABLE_REGION_NAME
                    + " FROM " + ADM_RURAL_AREAS_TABLE);
            ResultSet rs = stmt.executeQuery();

            while (rs.next()) {
                String municipalityName = rs.getString(ADM_RURAL_AREAS_TABLE_REGION_NAME);
                allRegionsList.add(municipalityName);
            }
            rs.close();
            stmt.close();
        } catch (SQLException e) {
            e.printStackTrace();
        }
        return allRegionsList;
    }

    public List<String> getAllDistrictsByRegion(String region) {
        List<String> allDistrictsList = new ArrayList<String>();

        try (Connection connection = ProductionCapacityDatabaseManager.getConnection();) {
            PreparedStatement stmt = connection.prepareStatement("SELECT DISTINCT "
                    + ADM_RURAL_AREAS_TABLE_DISTRICT_NAME + " FROM " + ADM_RURAL_AREAS_TABLE + " WHERE "
                    + ADM_RURAL_AREAS_TABLE_REGION_NAME + "=?");
            stmt.setString(1, region);
            ResultSet rs = stmt.executeQuery();

            while (rs.next()) {
                String districtName = rs.getString(ADM_RURAL_AREAS_TABLE_DISTRICT_NAME);
                allDistrictsList.add(districtName);
            }
            rs.close();
            stmt.close();
        } catch (SQLException e) {
            e.printStackTrace();
        }

        return allDistrictsList;
    }

    public List<String> getAllMunicipalitiesByDistrict(String district) {
        List<String> allMunicipalitiesList = new ArrayList<String>();

        try (Connection connection = ProductionCapacityDatabaseManager.getConnection();) {
            PreparedStatement stmt = connection.prepareStatement("SELECT DISTINCT "
                    + ADM_RURAL_AREAS_TABLE_MUNICIPALITY_NAME + " FROM " + ADM_RURAL_AREAS_TABLE + " WHERE "
                    + ADM_RURAL_AREAS_TABLE_DISTRICT_NAME + "=?");
            stmt.setString(1, district);
            ResultSet rs = stmt.executeQuery();

            while (rs.next()) {
                String districtName = rs.getString(ADM_RURAL_AREAS_TABLE_MUNICIPALITY_NAME);
                allMunicipalitiesList.add(districtName);
            }
            rs.close();
            stmt.close();
        } catch (SQLException e) {
            e.printStackTrace();
        }

        return allMunicipalitiesList;
    }
}
